src/Catalogs/Фирма/Фирма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фирма</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>РабочийДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДниНедели</name>
      <type>
        <types>EnumRef.ДнииНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оканчание</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Фирма/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура выделетьВсё(Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.РабочийДень=Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура снятьВыделение (Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.РабочийДень= Ложь;
			КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьВремя(Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.Начало='000101010900';
		Элемент.Оканчание='000101011900';
	КонецЦикла;
КонецПроцедуры
